-- phpMyAdmin SQL Dump
-- version 4.0.4
-- http://www.phpmyadmin.net
--
-- 主机: localhost
-- 生成日期: 2015 年 07 月 28 日 05:48
-- 服务器版本: 5.6.12-log
-- PHP 版本: 5.4.16

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;

--
-- 数据库: `tongmeng`
--
CREATE DATABASE IF NOT EXISTS `tongmeng` DEFAULT CHARACTER SET utf8 COLLATE utf8_general_ci;
USE `tongmeng`;

-- --------------------------------------------------------

--
-- 表的结构 `tm_address`
--

CREATE TABLE IF NOT EXISTS `tm_address` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT '收货地址id',
  `uid` int(11) NOT NULL COMMENT '用户id',
  `name` char(32) NOT NULL COMMENT '收货人姓名',
  `addr` char(32) NOT NULL COMMENT '收货人地址',
  `postcode` bigint(100) NOT NULL COMMENT '邮政编码',
  `telphone` bigint(32) NOT NULL COMMENT '收货人电话',
  `defaultaddr` int(3) NOT NULL DEFAULT '0' COMMENT '默认收货地址',
  PRIMARY KEY (`id`)
) ENGINE=MyISAM  DEFAULT CHARSET=utf8 COMMENT=' 收货地址表' AUTO_INCREMENT=10 ;

--
-- 转存表中的数据 `tm_address`
--

INSERT INTO `tm_address` (`id`, `uid`, `name`, `addr`, `postcode`, `telphone`, `defaultaddr`) VALUES
(1, 1, '1', '安徽省|宿州市|砀城镇|d', 0, 1, 0),
(2, 1, '乐高', '重庆市|重庆市|九龙坡区|454', 454, 4545, 0),
(3, 4, 'japan', '内蒙古|呼和浩特市|回民区|蒙牛', 99999999999999, 13220161618, 0),
(4, 5, 'li', '江苏省|南通市|启东市|ssasdssasd', 123456, 13212345678, 0),
(5, 5, 'lisi', '浙江省|衢州市|常山县|kfdsllfdlkdal', 123456, 13412345678, 0),
(6, 6, '童梦网', '请选择|请选择|请选择|', 0, 0, 0),
(7, 6, 'asdsad', '上海市|上海市|长宁区|asdsad', 45300, 13212345678, 1),
(8, 6, 'asdsad', '重庆市|重庆市|沙坪坝区|asdsad', 123456, 13212345678, 1),
(9, 2, 'wang', '山西省|晋城市|沁水县|wwwwwww', 111111, 13220161612, 0);

-- --------------------------------------------------------

--
-- 表的结构 `tm_admin`
--

CREATE TABLE IF NOT EXISTS `tm_admin` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT '管理员ID',
  `username` char(32) NOT NULL COMMENT '管理员名',
  `password` char(33) NOT NULL COMMENT '管理员密码',
  PRIMARY KEY (`id`),
  UNIQUE KEY `username` (`username`),
  UNIQUE KEY `username_2` (`username`)
) ENGINE=MyISAM  DEFAULT CHARSET=utf8 COMMENT='tm_admin 管理员表' AUTO_INCREMENT=57 ;

--
-- 表的结构 `tm_advertising`
--

CREATE TABLE IF NOT EXISTS `tm_advertising` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT '广告ID',
  `content` text NOT NULL COMMENT '广告内容',
  `links` char(50) NOT NULL COMMENT '广告链接',
  `img` char(50) NOT NULL COMMENT '广告图片',
  PRIMARY KEY (`id`)
) ENGINE=MyISAM  DEFAULT CHARSET=utf8 COMMENT='tm_advertising广告表' AUTO_INCREMENT=7 ;

--
-- 转存表中的数据 `tm_advertising`
--

INSERT INTO `tm_advertising` (`id`, `content`, `links`, `img`) VALUES
(6, '广告', '', 'Uploads/2015-07-28/55b6d44d22551.jpg');

-- --------------------------------------------------------

--
-- 表的结构 `tm_bullentin`
--

CREATE TABLE IF NOT EXISTS `tm_bullentin` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT '网站公告ID',
  `title` varchar(255) NOT NULL COMMENT '网站公告标题',
  `content` text NOT NULL COMMENT '网站公告内容',
  `btime` int(32) NOT NULL COMMENT '网站公告发布时间',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB  DEFAULT CHARSET=utf8 COMMENT='tm_bullentin网站公告表' AUTO_INCREMENT=6 ;

--
-- 转存表中的数据 `tm_bullentin`
--

INSERT INTO `tm_bullentin` (`id`, `title`, `content`, `btime`) VALUES
(5, '童梦网正式开业了！', '童梦网经过三个星期的店铺装修，终于要和大家见面了。本月26日试营业，会员所有商品八五折起。', 1437635147);

-- --------------------------------------------------------

--
-- 表的结构 `tm_cart`
--

CREATE TABLE IF NOT EXISTS `tm_cart` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT '购物车ID',
  `uid` int(11) NOT NULL COMMENT '用户ID',
  `gid` int(11) NOT NULL COMMENT '商品ID[JSON]格式 {gid1:num1}',
  `goodsname` char(125) NOT NULL COMMENT '商品名字',
  `goodsprice` decimal(10,2) NOT NULL COMMENT '商品单价',
  `number` int(125) NOT NULL COMMENT '商品数量',
  `cartprice` decimal(10,2) NOT NULL COMMENT '  商品总价',
  PRIMARY KEY (`id`)
) ENGINE=MyISAM  DEFAULT CHARSET=utf8 COMMENT='tm_cart购物车表' AUTO_INCREMENT=34 ;

--
-- 转存表中的数据 `tm_cart`
--

INSERT INTO `tm_cart` (`id`, `uid`, `gid`, `goodsname`, `goodsprice`, `number`, `cartprice`) VALUES
(7, 5, 4, '小黄帽C-04', '299.00', 1, '299.00'),
(32, 4, 8, '酷跑A-03', '344.00', 1, '344.00'),
(28, 8, 7, '酷跑A-02', '455.00', 1, '455.00'),
(27, 8, 4, '小黄帽C-04', '299.00', 1, '299.00'),
(29, 6, 24, '遥控冠军E-07', '122.00', 1, '122.00');

-- --------------------------------------------------------

--
-- 表的结构 `tm_comment`
--

CREATE TABLE IF NOT EXISTS `tm_comment` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT '评论 ID',
  `uid` int(11) NOT NULL COMMENT '用户ID',
  `gid` int(11) NOT NULL COMMENT '商品ID',
  `commentcontent` text NOT NULL COMMENT '评论内容',
  `commenttime` int(50) NOT NULL COMMENT '评论时间',
  PRIMARY KEY (`id`)
) ENGINE=MyISAM  DEFAULT CHARSET=utf8 COMMENT='tm_comment商品评价表' AUTO_INCREMENT=22 ;

--
-- 转存表中的数据 `tm_comment`
--

INSERT INTO `tm_comment` (`id`, `uid`, `gid`, `commentcontent`, `commenttime`) VALUES
(7, 33, 3333, '惹他惹他retreatretreat尔特让他电饭锅电饭锅发的方的观点', 145454555),
(12, 5, 4, 'sgdrgdfgdfgdfgdfgdfgf', 4555655),
(6, 3, 4, '梵蒂冈反反复复凤飞飞飞凤飞飞凤飞飞凤飞飞凤飞飞凤飞飞的顶顶顶顶顶的顶顶顶顶顶顶顶顶顶顶顶顶顶顶顶', 45654444),
(8, 33, 3333, '惹他惹他retreatretreat尔特让他电饭锅电饭锅发的方的观点', 145454555),
(9, 44, 44, '饿死他仍然让他热特瑞特让他', 2147483647),
(10, 44, 44, '饿死他仍然让他热特瑞特让他', 88888888),
(11, 444, 444, '天赋犹太人', 444444444),
(13, 0, 4, '              dwdwdwd', 1437211829),
(14, 0, 0, '             dadfdfa', 1437213251),
(15, 0, 0, ' 商品不错,值得信赖', 1437213426),
(16, 2, 0, '        商品还行', 1437214602),
(17, 2, 6, '              额外热温热温热', 1437214755),
(18, 3, 2, '              ddsfdafssaads', 1437309897),
(19, 2, 2, '              ', 1437581420),
(20, 2, 2, '              ', 1437581486),
(21, 2, 5, '              ', 1437581520);

-- --------------------------------------------------------

--
-- 表的结构 `tm_config`
--

CREATE TABLE IF NOT EXISTS `tm_config` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT '网站配置ID',
  `title` varchar(100) NOT NULL DEFAULT '同梦网' COMMENT '网站标题',
  `keywords` varchar(100) NOT NULL DEFAULT '专注玩具销售' COMMENT '网站关键字',
  `description` varchar(255) NOT NULL DEFAULT '做质量做好,服务最好的玩具商城' COMMENT '网站描述',
  `logo` varchar(100) NOT NULL DEFAULT 'logo.png' COMMENT '网站LOGO',
  `status` tinyint(3) NOT NULL DEFAULT '1' COMMENT '网站开关',
  `cnzz` varchar(100) NOT NULL DEFAULT '站长统计' COMMENT '网站统计代码',
  `icp` varchar(100) NOT NULL DEFAULT '京ICP——68686989556号' COMMENT '网站ICP备案号',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB  DEFAULT CHARSET=utf8 AUTO_INCREMENT=2 ;

--
-- 转存表中的数据 `tm_config`
--

INSERT INTO `tm_config` (`id`, `title`, `keywords`, `description`, `logo`, `status`, `cnzz`, `icp`) VALUES
(1, '童梦网', '专注玩具销售', '做最好的玩具商城', './Public/Uploads/2015-07-27/55b5cbc0e1113.png', 1, '站长统计', '京ICP备18038866号');

-- --------------------------------------------------------

--
-- 表的结构 `tm_feekback`
--

CREATE TABLE IF NOT EXISTS `tm_feekback` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT '用户反馈ID',
  `uid` int(11) NOT NULL COMMENT '用户ID',
  `feekbacktitle` varchar(255) NOT NULL COMMENT '用户反馈标题',
  `feekbackcontent` text NOT NULL COMMENT '反馈内容',
  `feekbacktime` int(50) NOT NULL COMMENT '用户反馈时间',
  PRIMARY KEY (`id`)
) ENGINE=MyISAM  DEFAULT CHARSET=utf8 COMMENT='tm_feekback用户反馈表' AUTO_INCREMENT=16 ;

--
-- 转存表中的数据 `tm_feekback`
--

INSERT INTO `tm_feekback` (`id`, `uid`, `feekbacktitle`, `feekbackcontent`, `feekbacktime`) VALUES
(8, 2, '2', '2222222222', 1437299865),
(9, 3, 'a', 'aaaaa', 1437307214),
(10, 3, 'b', 'bbbbbbbbbbbbbbbb', 1437307231),
(11, 2, '3', '3333333333', 1437531783),
(15, 6, '1', '11111111111111111111111', 1437977741),
(14, 5, '1', '1111111111111111111', 1437961160);

-- --------------------------------------------------------

--
-- 表的结构 `tm_goods`
--

CREATE TABLE IF NOT EXISTS `tm_goods` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT '商品ID',
  `tid` int(11) NOT NULL COMMENT '商品所属分类ID',
  `goodsname` varchar(255) NOT NULL COMMENT '商品名称',
  `goodsdesc` text NOT NULL COMMENT '商品描述',
  `salesnum` int(11) NOT NULL DEFAULT '0' COMMENT '商品销量',
  `stock` int(11) NOT NULL DEFAULT '0' COMMENT '库存',
  `price` decimal(10,2) NOT NULL DEFAULT '0.00' COMMENT '商品价格',
  `comment` int(11) NOT NULL DEFAULT '0' COMMENT '商品评论次数',
  `goodspic` varchar(255) NOT NULL COMMENT '商品图片',
  `cupon` tinyint(3) NOT NULL DEFAULT '0' COMMENT '是否可用优惠价 0为不可用1为可用',
  `status` tinyint(3) NOT NULL DEFAULT '1' COMMENT '是否上架 1为上架 0为下架',
  PRIMARY KEY (`id`)
) ENGINE=MyISAM  DEFAULT CHARSET=utf8 COMMENT='tm_goods 商品表' AUTO_INCREMENT=25 ;

--
-- 转存表中的数据 `tm_goods`
--

INSERT INTO `tm_goods` (`id`, `tid`, `goodsname`, `goodsdesc`, `salesnum`, `stock`, `price`, `comment`, `goodspic`, `cupon`, `status`) VALUES
(1, 8, '小熊钧泽C-01', '&lt;p&gt;小熊钧泽C-01&lt;/p&gt;', 3, 100, '399.00', 1, 'Uploads/2015-07-23/55b09832ca2dd.jpg', 0, 1),
(2, 8, '小熊钧泽C-02', '&lt;p&gt;小熊钧泽C-02&lt;/p&gt;', 18, 100, '300.00', 12, 'Uploads/2015-07-23/55b0989ca037a.jpg', 0, 1),
(3, 9, '小黄帽C-03', '&lt;p&gt;小黄帽C-03&lt;/p&gt;', 50, 12, '298.00', 12, 'Uploads/2015-07-23/55b09916501bd.jpg', 0, 1),
(4, 9, '小黄帽C-04', '&lt;p&gt;小黄帽C-04&lt;/p&gt;', 12, 111, '299.00', 1, 'Uploads/2015-07-23/55b099593d090.jpg', 0, 1),
(5, 9, '小熊贝贝C-05', '&lt;p&gt;小熊贝贝C-05&lt;/p&gt;', 12, 1000, '198.00', 12, 'Uploads/2015-07-23/55b099dc57bcf.jpg', 0, 1),
(6, 12, '酷跑A-01', '&lt;p&gt;酷跑A-01&lt;/p&gt;', 12, 100, '359.00', 11, 'Uploads/2015-07-23/55b09aef1312d.jpg', 1, 1),
(7, 12, '酷跑A-02', '&lt;p&gt;酷跑A-02&lt;/p&gt;', 3, 100, '455.00', 1, 'Uploads/2015-07-23/55b09b451e848.jpg', 0, 1),
(8, 12, '酷跑A-03', '&lt;p&gt;酷跑A-03&lt;/p&gt;', 12, 100, '344.00', 4, 'Uploads/2015-07-23/55b09b7e4c4b4.jpg', 0, 1),
(9, 12, '酷跑飞机A-01', '&lt;p&gt;酷跑飞机A-01&lt;/p&gt;', 30, 12, '677.00', 111, 'Uploads/2015-07-23/55b09bfa40d99.jpg', 0, 1),
(10, 6, '托马斯A-01', '&lt;p&gt;托马斯A-01&lt;/p&gt;', 100, 12, '67.00', 11, 'Uploads/2015-07-23/55b09ca894c5f.jpg', 0, 1),
(11, 6, '托马斯A-02', '&lt;p&gt;托马斯A-02&lt;/p&gt;', 12, 100, '34.00', 12, 'Uploads/2015-07-23/55b09cdac28cb.jpg', 0, 1),
(12, 7, '奥蒂仿真车E-01', '&lt;p&gt;奥蒂仿真车E-01&lt;/p&gt;', 10, 100, '156.00', 1, 'Uploads/2015-07-24/55b195720b71b.jpg', 0, 1),
(13, 7, '奥蒂仿真车E-02', '&lt;p&gt;奥蒂仿真车E-02&lt;/p&gt;', 1, 100, '199.00', 0, 'Uploads/2015-07-24/55b195d216e36.jpg', 0, 1),
(14, 7, '小钢琴仿真E-03', '&lt;p&gt;小钢琴&lt;/p&gt;', 8, 100, '120.00', 2, 'Uploads/2015-07-24/55b196503d090.jpg', 1, 1),
(15, 7, '遥控小飞飞E-04', '&lt;p&gt;遥控小飞飞E-04&lt;br/&gt;&lt;/p&gt;', 10, 100, '100.00', 2, 'Uploads/2015-07-24/55b1973676417.jpg', 0, 1),
(16, 7, '遥控小飞飞E-05', '&lt;p&gt;遥控小飞飞E-05&lt;/p&gt;', 1, 17, '125.00', 0, 'Uploads/2015-07-24/55b1989857bcf.jpg', 0, 1),
(17, 10, '聪明宝F-01', '&lt;p&gt;聪明宝F-01&lt;br/&gt;&lt;/p&gt;', 1, 16, '134.00', 0, 'Uploads/2015-07-24/55b1991e6acfc.jpg', 0, 1),
(18, 10, '聪明宝F-02', '&lt;p&gt;聪明宝F-02&lt;/p&gt;', 23, 110, '190.00', 11, 'Uploads/2015-07-24/55b19b3166ff3.jpg', 0, 1),
(19, 11, '铃F-01', '&lt;p&gt;铃F-01&lt;/p&gt;', 12, 100, '14.00', 1, 'Uploads/2015-07-24/55b19bf91312d.jpg', 0, 1),
(20, 13, '多啦A铃铛G-01', '&lt;p&gt;多啦A铃铛G-01&lt;/p&gt;', 1, 100, '12.00', 1, 'Uploads/2015-07-24/55b1e79bec82e.jpg', 0, 1),
(21, 13, '多啦A铃铛G-02', '&lt;p&gt;多啦A铃铛G-02&lt;/p&gt;', 12, 18, '19.00', 1, 'Uploads/2015-07-24/55b1e7ded9701.jpg', 0, 1),
(22, 13, '多啦A铃铛G-03', '&lt;p&gt;多啦A铃铛G-03&lt;/p&gt;', 1, 12, '1.00', 1, 'Uploads/2015-07-24/55b1e823ca2dd.jpg', 0, 1),
(23, 7, '遥控冠军E-06', '&lt;p&gt;遥控冠军E-06&lt;/p&gt;', 12, 11, '299.00', 15, 'Uploads/2015-07-24/55b1e8a594c5f.jpg', 0, 1),
(24, 7, '遥控冠军E-07', '&lt;p&gt;遥控冠军E-07&lt;/p&gt;', 16, 100, '122.00', 12, 'Uploads/2015-07-24/55b1e8fca7d8c.jpg', 0, 1);

-- --------------------------------------------------------

--
-- 表的结构 `tm_goodscollect`
--

CREATE TABLE IF NOT EXISTS `tm_goodscollect` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT '商品收藏ID',
  `gid` int(11) NOT NULL COMMENT '商品ID',
  `uid` int(11) NOT NULL COMMENT '用户ID',
  `goodsname` varchar(120) NOT NULL COMMENT '商品名称',
  `collecttime` int(50) NOT NULL COMMENT '收藏时间',
  PRIMARY KEY (`id`)
) ENGINE=MyISAM  DEFAULT CHARSET=utf8 COMMENT='tm_goodscollect商品收藏表' AUTO_INCREMENT=30 ;

--
-- 转存表中的数据 `tm_goodscollect`
--

INSERT INTO `tm_goodscollect` (`id`, `gid`, `uid`, `goodsname`, `collecttime`) VALUES
(7, 3, 1, '大狗熊', 38885476),
(8, 2, 1, '欧迪', 66355284),
(29, 8, 2, '酷跑A-03', 1438046431),
(28, 18, 2, '聪明宝F-02', 1438046419),
(23, 6, 3, '酷跑A-01', 1437639970),
(24, 9, 3, '酷跑飞机A-01', 1437640053),
(25, 2, 5, '小熊钧泽C-02', 1437961512),
(26, 9, 6, '酷跑飞机A-01', 1437963985),
(27, 2, 6, '小熊钧泽C-02', 1437964035);

-- --------------------------------------------------------

--
-- 表的结构 `tm_goodshistroy`
--

CREATE TABLE IF NOT EXISTS `tm_goodshistroy` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT '商品浏览历史ID',
  `uid` int(11) NOT NULL COMMENT '用户ID',
  `gid` int(11) NOT NULL COMMENT '商品ID',
  `goodsname` varchar(125) NOT NULL COMMENT '商品名',
  `histroytime` int(50) NOT NULL COMMENT '商品浏览时间',
  PRIMARY KEY (`id`)
) ENGINE=MyISAM  DEFAULT CHARSET=utf8 COMMENT='tm_goodshistroy商品浏览历史表' AUTO_INCREMENT=82 ;

--
-- 转存表中的数据 `tm_goodshistroy`
--

INSERT INTO `tm_goodshistroy` (`id`, `uid`, `gid`, `goodsname`, `histroytime`) VALUES
(80, 2, 18, '聪明宝F-02', 1438046569),
(79, 2, 18, '聪明宝F-02', 1438046565),
(7, 1, 2, '的的纯电动', 34456566),
(9, 4, 2, '发达的发发', 43344345),
(10, 6, 3, '发放大哥大', 5657667),
(11, 7, 4, '官方非官方', 4344343),
(78, 2, 8, '酷跑A-03', 1438046477),
(15, 3, 1, '小熊钧泽C-01', 1437640586),
(16, 3, 2, '小熊钧泽C-02', 1437640590),
(17, 3, 3, '小黄帽C-03', 1437640593),
(18, 3, 4, '小黄帽C-04', 1437640595),
(19, 3, 4, '小黄帽C-04', 1437640639),
(20, 5, 6, '酷跑A-01', 1437651308),
(21, 5, 2, '小熊钧泽C-02', 1437651980),
(22, 5, 10, '托马斯A-01', 1437652011),
(23, 5, 4, '小黄帽C-04', 1437652448),
(24, 5, 7, '酷跑A-02', 1437652644),
(25, 5, 9, '酷跑飞机A-01', 1437652667),
(26, 5, 6, '酷跑A-01', 1437652674),
(27, 1, 2, '小熊钧泽C-02', 1437653048),
(28, 1, 11, '托马斯A-02', 1437653067),
(29, 1, 9, '酷跑飞机A-01', 1437653081),
(30, 1, 6, '酷跑A-01', 1437653285),
(31, 4, 7, '酷跑A-02', 1437661137),
(32, 4, 7, '酷跑A-02', 1437661215),
(33, 4, 7, '酷跑A-02', 1437742955),
(34, 4, 2, '小熊钧泽C-02', 1437811486),
(35, 5, 4, '小黄帽C-04', 1437961259),
(36, 5, 2, '小熊钧泽C-02', 1437961507),
(37, 5, 2, '小熊钧泽C-02', 1437961514),
(38, 6, 9, '酷跑飞机A-01', 1437961952),
(39, 6, 9, '酷跑飞机A-01', 1437963982),
(40, 6, 9, '酷跑飞机A-01', 1437963987),
(41, 6, 9, '酷跑飞机A-01', 1437963997),
(42, 6, 9, '酷跑飞机A-01', 1437964009),
(43, 6, 9, '酷跑飞机A-01', 1437964022),
(44, 6, 2, '小熊钧泽C-02', 1437964033),
(45, 6, 2, '小熊钧泽C-02', 1437964038),
(46, 6, 2, '小熊钧泽C-02', 1437964047),
(47, 6, 8, '酷跑A-03', 1437964177),
(48, 6, 9, '酷跑飞机A-01', 1437964457),
(49, 6, 8, '酷跑A-03', 1437964477),
(50, 6, 8, '酷跑A-03', 1437964947),
(51, 6, 8, '酷跑A-03', 1437965012),
(52, 6, 9, '酷跑飞机A-01', 1437965099),
(53, 6, 6, '酷跑A-01', 1437965855),
(54, 6, 1, '小熊钧泽C-01', 1437965899),
(55, 6, 2, '小熊钧泽C-02', 1437965963),
(56, 6, 6, '酷跑A-01', 1437966072),
(57, 6, 8, '酷跑A-03', 1437966272),
(58, 6, 3, '小黄帽C-03', 1437966375),
(59, 6, 3, '小黄帽C-03', 1437966561),
(60, 6, 1, '小熊钧泽C-01', 1437966587),
(61, 6, 2, '小熊钧泽C-02', 1437966807),
(62, 6, 2, '小熊钧泽C-02', 1437966822),
(63, 6, 10, '托马斯A-01', 1437966914),
(64, 6, 10, '托马斯A-01', 1437966950),
(65, 8, 6, '酷跑A-01', 1437968602),
(66, 8, 4, '小黄帽C-04', 1437968619),
(67, 8, 7, '酷跑A-02', 1437968633),
(68, 6, 2, '小熊钧泽C-02', 1437981373),
(69, 6, 24, '遥控冠军E-07', 1437981706),
(70, 6, 6, '酷跑A-01', 1437981756),
(71, 4, 2, '小熊钧泽C-02', 1437982648),
(72, 4, 8, '酷跑A-03', 1437986772),
(73, 4, 8, '酷跑A-03', 1437986800),
(74, 2, 18, '聪明宝F-02', 1438046416),
(75, 2, 18, '聪明宝F-02', 1438046421),
(76, 2, 8, '酷跑A-03', 1438046428),
(77, 2, 8, '酷跑A-03', 1438046433),
(81, 2, 18, '聪明宝F-02', 1438046655);

-- --------------------------------------------------------

--
-- 表的结构 `tm_goodstype`
--

CREATE TABLE IF NOT EXISTS `tm_goodstype` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT '商品栏目ID',
  `name` varchar(100) NOT NULL COMMENT '商品类别名',
  `pid` int(11) NOT NULL DEFAULT '0' COMMENT '父分类ID',
  `path` char(255) NOT NULL DEFAULT '0' COMMENT '路径',
  PRIMARY KEY (`id`)
) ENGINE=MyISAM  DEFAULT CHARSET=utf8 COMMENT='tm_goodstype 商品分类表' AUTO_INCREMENT=15 ;

--
-- 转存表中的数据 `tm_goodstype`
--

INSERT INTO `tm_goodstype` (`id`, `name`, `pid`, `path`) VALUES
(1, '电动玩具', 0, '0'),
(2, '遥控玩具', 0, '0'),
(3, '毛绒玩具', 0, '0'),
(4, '益智玩具', 0, '0'),
(5, '婴幼儿玩具', 0, '0'),
(6, '孩子宝品牌', 1, '0-1'),
(7, '美泰品牌', 2, '0-2'),
(8, '迪奥', 3, '0-3'),
(9, 'barby', 3, '0-3'),
(10, '多美品牌', 4, '0-4'),
(11, '乐高品牌', 5, '0-5'),
(12, '迪奥品牌', 1, '0-1'),
(13, '迪士尼品牌', 5, '0-5');

-- --------------------------------------------------------

--
-- 表的结构 `tm_help`
--

CREATE TABLE IF NOT EXISTS `tm_help` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT '帮助中心ID',
  `title` char(32) NOT NULL COMMENT '帮助主题',
  `content` text NOT NULL COMMENT '帮助内容',
  `time` int(32) NOT NULL COMMENT '帮助发布时间',
  PRIMARY KEY (`id`)
) ENGINE=MyISAM  DEFAULT CHARSET=utf8 COMMENT='tm_help帮助中心表' AUTO_INCREMENT=12 ;

--
-- 转存表中的数据 `tm_help`
--

INSERT INTO `tm_help` (`id`, `title`, `content`, `time`) VALUES
(11, '服务承诺', '童梦网坚持“诚信为本”的经营理念，为广大客户提供最优质的商品及服务，我们保证所售商品均为正品。如果您认为购买的商品是假货，并能提供国家相关质检机构的证明文件，我们会按照国家法律规定予以处理。假货举报邮箱：jiahuojubao@cs.dangdang.com。但对于任何欺诈性行为，当当将保留依法追究法律责任的权利。本规则由童梦网根据国家相关法律法规及规章制度予以解释。', 1438047141),
(10, '这里标题内容', '这里标题内容这里标题内容这里标题内容这里标题内容这里标题内容这里标题内容这里标题内容', 1437976821);

-- --------------------------------------------------------

--
-- 表的结构 `tm_job`
--

CREATE TABLE IF NOT EXISTS `tm_job` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT '应聘表ID',
  `name` char(32) NOT NULL COMMENT '应聘者姓名',
  `office` char(32) NOT NULL COMMENT '应聘职位',
  `telephone` int(12) NOT NULL COMMENT '应聘者电话',
  `description` text NOT NULL COMMENT '自我介绍',
  `time` int(50) NOT NULL COMMENT '提交时间',
  PRIMARY KEY (`id`)
) ENGINE=MyISAM  DEFAULT CHARSET=utf8 COMMENT='tm_job应聘表' AUTO_INCREMENT=19 ;

--
-- 转存表中的数据 `tm_job`
--

INSERT INTO `tm_job` (`id`, `name`, `office`, `telephone`, `description`, `time`) VALUES
(18, '周杰伦', 'PHP', 1101976343, '中国好声音', 1437648843);

-- --------------------------------------------------------

--
-- 表的结构 `tm_link`
--

CREATE TABLE IF NOT EXISTS `tm_link` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT '友链ID',
  `linkname` char(32) NOT NULL COMMENT '友链名字',
  `links` char(50) NOT NULL COMMENT '友链地址',
  `logo` char(50) NOT NULL DEFAULT 'logo.png' COMMENT '友链logo',
  PRIMARY KEY (`id`)
) ENGINE=MyISAM  DEFAULT CHARSET=utf8 COMMENT='tm_link友链表' AUTO_INCREMENT=18 ;

--
-- 转存表中的数据 `tm_link`
--

INSERT INTO `tm_link` (`id`, `linkname`, `links`, `logo`) VALUES
(15, '支付宝', 'http://www.alipay.com', 'logo.png'),
(14, '百度', 'http://www.baidu.com', 'logo.png'),
(17, '谷歌', 'http://www.google.com', 'logo.png');

-- --------------------------------------------------------

--
-- 表的结构 `tm_log`
--

CREATE TABLE IF NOT EXISTS `tm_log` (
  `id` int(32) NOT NULL AUTO_INCREMENT COMMENT '管理员登录日志ID',
  `aid` int(11) unsigned zerofill NOT NULL COMMENT '管理员ID',
  `logip` char(32) NOT NULL DEFAULT '0.0.0.0' COMMENT '管理员登录 IP',
  `logtime` int(32) NOT NULL COMMENT '管理员登录时间',
  `lognums` int(11) NOT NULL COMMENT '管理员登录次数',
  PRIMARY KEY (`id`)
) ENGINE=MyISAM  DEFAULT CHARSET=utf8 COMMENT='tm_log 管理员登录日志表' AUTO_INCREMENT=254 ;

--
-- 转存表中的数据 `tm_log`
--

INSERT INTO `tm_log` (`id`, `aid`, `logip`, `logtime`, `lognums`) VALUES
(17, 00000000038, '::1', 1436542795, 1),
(133, 00000000038, '::1', 1436949783, 1),
(132, 00000000038, '::1', 1436948725, 1),
(4, 00000000038, '::1', 1436533925, 1),
(5, 00000000038, '::1', 1436533957, 1),
(13, 00000000038, '::1', 1436535185, 1),
(15, 00000000038, '::1', 1436536535, 1),
(8, 00000000038, '::1', 1436534844, 1),
(14, 00000000038, '::1', 1436535573, 1),
(10, 00000000038, '::1', 1436534851, 1),
(16, 00000000038, '::1', 1436542759, 1),
(12, 00000000038, '::1', 1436534852, 1),
(18, 00000000038, '::1', 1436544968, 1),
(19, 00000000038, '::1', 1436545834, 1),
(20, 00000000038, '::1', 1436593591, 1),
(21, 00000000038, '::1', 1436597642, 1),
(22, 00000000038, '::1', 1436597642, 1),
(23, 00000000038, '::1', 1436608599, 1),
(24, 00000000038, '::1', 1436608778, 1),
(25, 00000000038, '::1', 1436611024, 1),
(26, 00000000038, '::1', 1436611059, 1),
(27, 00000000038, '::1', 1436611719, 1),
(28, 00000000038, '::1', 1436619493, 1),
(29, 00000000038, '::1', 1436623230, 1),
(30, 00000000038, '::1', 1436624135, 1),
(31, 00000000038, '::1', 1436624785, 1),
(32, 00000000038, '::1', 1436626131, 1),
(33, 00000000038, '::1', 1436628024, 1),
(34, 00000000038, '::1', 1436628480, 1),
(35, 00000000038, '::1', 1436629803, 1),
(36, 00000000038, '::1', 1436629830, 1),
(37, 00000000038, '::1', 1436630477, 1),
(38, 00000000038, '127.0.0.1', 1436680014, 1),
(39, 00000000038, '127.0.0.1', 1436680101, 1),
(40, 00000000038, '127.0.0.1', 1436681343, 1),
(41, 00000000038, '127.0.0.1', 1436681380, 1),
(42, 00000000038, '127.0.0.1', 1436681463, 1),
(43, 00000000038, '127.0.0.1', 1436681501, 1),
(44, 00000000038, '127.0.0.1', 1436682799, 1),
(45, 00000000038, '127.0.0.1', 1436684247, 1),
(46, 00000000038, '127.0.0.1', 1436687299, 1),
(47, 00000000038, '127.0.0.1', 1436687322, 1),
(48, 00000000038, '127.0.0.1', 1436687942, 1),
(49, 00000000038, '::1', 1436688271, 1),
(50, 00000000038, '::1', 1436688696, 1),
(51, 00000000038, '127.0.0.1', 1436693286, 1),
(52, 00000000038, '::1', 1436693523, 1),
(53, 00000000038, '::1', 1436693558, 1),
(54, 00000000038, '::1', 1436693861, 1),
(55, 00000000038, '::1', 1436693870, 1),
(56, 00000000038, '::1', 1436695295, 1),
(57, 00000000038, '::1', 1436695628, 1),
(58, 00000000038, '::1', 1436698970, 1),
(59, 00000000038, '::1', 1436698972, 1),
(60, 00000000038, '127.0.0.1', 1436700370, 1),
(61, 00000000038, '127.0.0.1', 1436700461, 1),
(62, 00000000038, '127.0.0.1', 1436700490, 1),
(63, 00000000038, '::1', 1436700587, 1),
(64, 00000000038, '::1', 1436700689, 1),
(65, 00000000041, '::1', 1436701069, 1),
(66, 00000000041, '::1', 1436701464, 1),
(67, 00000000041, '::1', 1436708447, 1),
(68, 00000000041, '::1', 1436709472, 1),
(69, 00000000038, '::1', 1436709493, 1),
(70, 00000000038, '::1', 1436712250, 1),
(71, 00000000038, '::1', 1436712279, 1),
(72, 00000000038, '::1', 1436712304, 1),
(73, 00000000038, '::1', 1436713061, 1),
(74, 00000000038, '::1', 1436713092, 1),
(75, 00000000038, '::1', 1436713663, 1),
(76, 00000000038, '::1', 1436714644, 1),
(77, 00000000038, '::1', 1436714724, 1),
(78, 00000000038, '::1', 1436715444, 1),
(79, 00000000038, '::1', 1436716729, 1),
(80, 00000000038, '::1', 1436768193, 1),
(81, 00000000038, '::1', 1436768939, 1),
(82, 00000000038, '::1', 1436769323, 1),
(83, 00000000038, '::1', 1436769324, 1),
(84, 00000000038, '::1', 1436769587, 1),
(85, 00000000038, '::1', 1436769605, 1),
(86, 00000000038, '::1', 1436787195, 1),
(87, 00000000038, '::1', 1436787316, 1),
(88, 00000000038, '::1', 1436787800, 1),
(89, 00000000038, '::1', 1436787811, 1),
(90, 00000000038, '::1', 1436789208, 1),
(91, 00000000038, '::1', 1436789806, 1),
(92, 00000000038, '::1', 1436789806, 1),
(93, 00000000038, '::1', 1436789807, 1),
(94, 00000000038, '::1', 1436789807, 1),
(95, 00000000038, '::1', 1436789808, 1),
(96, 00000000038, '::1', 1436789808, 1),
(97, 00000000038, '::1', 1436795526, 1),
(98, 00000000038, '::1', 1436795562, 1),
(99, 00000000038, '::1', 1436795606, 1),
(100, 00000000038, '::1', 1436795636, 1),
(101, 00000000038, '::1', 1436795636, 1),
(102, 00000000038, '::1', 1436795686, 1),
(103, 00000000038, '::1', 1436795689, 1),
(104, 00000000038, '::1', 1436795691, 1),
(105, 00000000038, '::1', 1436795724, 1),
(106, 00000000038, '::1', 1436795731, 1),
(107, 00000000038, '::1', 1436795732, 1),
(108, 00000000038, '::1', 1436795732, 1),
(109, 00000000038, '::1', 1436795734, 1),
(110, 00000000038, '::1', 1436795734, 1),
(111, 00000000038, '::1', 1436795768, 1),
(112, 00000000038, '::1', 1436795796, 1),
(113, 00000000038, '::1', 1436795815, 1),
(114, 00000000038, '::1', 1436795848, 1),
(115, 00000000038, '::1', 1436795868, 1),
(116, 00000000038, '::1', 1436795890, 1),
(117, 00000000038, '::1', 1436795929, 1),
(118, 00000000038, '::1', 1436836066, 1),
(119, 00000000038, '::1', 1436836639, 1),
(120, 00000000038, '::1', 1436838920, 1),
(121, 00000000038, '::1', 1436839255, 1),
(122, 00000000038, '::1', 1436842179, 1),
(123, 00000000038, '::1', 1436842191, 1),
(124, 00000000038, '::1', 1436842865, 1),
(125, 00000000038, '::1', 1436843162, 1),
(126, 00000000038, '::1', 1436846685, 1),
(127, 00000000038, '::1', 1436876564, 1),
(128, 00000000038, '::1', 1436922176, 1),
(129, 00000000038, '::1', 1436922930, 1),
(130, 00000000038, '::1', 1436922930, 1),
(131, 00000000038, '::1', 1436947857, 1),
(134, 00000000038, '::1', 1436973140, 1),
(135, 00000000038, '::1', 1437015232, 1),
(136, 00000000056, '::1', 1437100944, 1),
(137, 00000000056, '::1', 1437102568, 1),
(138, 00000000056, '::1', 1437102814, 1),
(139, 00000000056, '::1', 1437104169, 1),
(140, 00000000042, '127.0.0.1', 1437136858, 1),
(141, 00000000042, '127.0.0.1', 1437140448, 1),
(142, 00000000042, '127.0.0.1', 1437140854, 1),
(143, 00000000042, '127.0.0.1', 1437141012, 1),
(144, 00000000042, '127.0.0.1', 1437141055, 1),
(145, 00000000042, '127.0.0.1', 1437141076, 1),
(146, 00000000042, '127.0.0.1', 1437141151, 1),
(147, 00000000042, '127.0.0.1', 1437141219, 1),
(148, 00000000042, '127.0.0.1', 1437141743, 1),
(149, 00000000042, '127.0.0.1', 1437141807, 1),
(150, 00000000042, '127.0.0.1', 1437143631, 1),
(151, 00000000042, '127.0.0.1', 1437144006, 1),
(152, 00000000042, '127.0.0.1', 1437144760, 1),
(153, 00000000042, '127.0.0.1', 1437144923, 1),
(154, 00000000042, '127.0.0.1', 1437145110, 1),
(155, 00000000042, '127.0.0.1', 1437145250, 1),
(156, 00000000042, '127.0.0.1', 1437145788, 1),
(157, 00000000042, '127.0.0.1', 1437182692, 1),
(158, 00000000042, '127.0.0.1', 1437203178, 1),
(159, 00000000042, '127.0.0.1', 1437222645, 1),
(160, 00000000042, '127.0.0.1', 1437292760, 1),
(161, 00000000042, '127.0.0.1', 1437292981, 1),
(162, 00000000042, '127.0.0.1', 1437293057, 1),
(163, 00000000042, '127.0.0.1', 1437293116, 1),
(164, 00000000042, '127.0.0.1', 1437293194, 1),
(165, 00000000042, '127.0.0.1', 1437293684, 1),
(166, 00000000042, '127.0.0.1', 1437293722, 1),
(167, 00000000042, '127.0.0.1', 1437294271, 1),
(168, 00000000042, '127.0.0.1', 1437294308, 1),
(169, 00000000042, '127.0.0.1', 1437294862, 1),
(170, 00000000042, '127.0.0.1', 1437296056, 1),
(171, 00000000042, '127.0.0.1', 1437301210, 1),
(172, 00000000042, '127.0.0.1', 1437301313, 1),
(173, 00000000042, '127.0.0.1', 1437301366, 1),
(174, 00000000042, '127.0.0.1', 1437301579, 1),
(175, 00000000042, '127.0.0.1', 1437308193, 1),
(176, 00000000042, '127.0.0.1', 1437317438, 1),
(177, 00000000042, '127.0.0.1', 1437361980, 1),
(178, 00000000042, '127.0.0.1', 1437376267, 1),
(179, 00000000042, '127.0.0.1', 1437376940, 1),
(180, 00000000042, '127.0.0.1', 1437377061, 1),
(181, 00000000042, '127.0.0.1', 1437379607, 1),
(182, 00000000042, '127.0.0.1', 1437494072, 1),
(183, 00000000042, '127.0.0.1', 1437529517, 1),
(184, 00000000042, '127.0.0.1', 1437530012, 1),
(185, 00000000042, '127.0.0.1', 1437530054, 1),
(186, 00000000042, '127.0.0.1', 1437530258, 1),
(187, 00000000042, '127.0.0.1', 1437530730, 1),
(188, 00000000042, '127.0.0.1', 1437530750, 1),
(189, 00000000042, '127.0.0.1', 1437531945, 1),
(190, 00000000042, '127.0.0.1', 1437532050, 1),
(191, 00000000042, '127.0.0.1', 1437532397, 1),
(192, 00000000042, '127.0.0.1', 1437533247, 1),
(193, 00000000042, '127.0.0.1', 1437533446, 1),
(194, 00000000042, '127.0.0.1', 1437535634, 1),
(195, 00000000042, '127.0.0.1', 1437535706, 1),
(196, 00000000042, '127.0.0.1', 1437535720, 1),
(197, 00000000042, '127.0.0.1', 1437543451, 1),
(198, 00000000042, '127.0.0.1', 1437543462, 1),
(199, 00000000042, '127.0.0.1', 1437543728, 1),
(200, 00000000042, '127.0.0.1', 1437544713, 1),
(201, 00000000042, '127.0.0.1', 1437545169, 1),
(202, 00000000042, '127.0.0.1', 1437545716, 1),
(203, 00000000042, '127.0.0.1', 1437545965, 1),
(204, 00000000042, '127.0.0.1', 1437546264, 1),
(205, 00000000042, '127.0.0.1', 1437546964, 1),
(206, 00000000042, '127.0.0.1', 1437548747, 1),
(207, 00000000042, '127.0.0.1', 1437556889, 1),
(208, 00000000042, '127.0.0.1', 1437561641, 1),
(209, 00000000042, '127.0.0.1', 1437562911, 1),
(210, 00000000042, '127.0.0.1', 1437562959, 1),
(211, 00000000042, '127.0.0.1', 1437563329, 1),
(212, 00000000042, '127.0.0.1', 1437563393, 1),
(213, 00000000042, '127.0.0.1', 1437576632, 1),
(214, 00000000042, '127.0.0.1', 1437577114, 1),
(215, 00000000042, '127.0.0.1', 1437577222, 1),
(216, 00000000042, '127.0.0.1', 1437635462, 1),
(217, 00000000042, '127.0.0.1', 1437635540, 1),
(218, 00000000042, '127.0.0.1', 1437636113, 1),
(219, 00000000042, '127.0.0.1', 1437636139, 1),
(220, 00000000042, '127.0.0.1', 1437636171, 1),
(221, 00000000042, '127.0.0.1', 1437636414, 1),
(222, 00000000042, '127.0.0.1', 1437648921, 1),
(223, 00000000042, '127.0.0.1', 1437650694, 1),
(224, 00000000042, '127.0.0.1', 1437651415, 1),
(225, 00000000042, '127.0.0.1', 1437652135, 1),
(226, 00000000042, '127.0.0.1', 1437652136, 1),
(227, 00000000042, '127.0.0.1', 1437652540, 1),
(228, 00000000042, '127.0.0.1', 1437655101, 1),
(229, 00000000042, '127.0.0.1', 1437655183, 1),
(230, 00000000042, '127.0.0.1', 1437655380, 1),
(231, 00000000042, '127.0.0.1', 1437655883, 1),
(232, 00000000042, '127.0.0.1', 1437659012, 1),
(233, 00000000042, '127.0.0.1', 1437659822, 1),
(234, 00000000042, '127.0.0.1', 1437659946, 1),
(235, 00000000042, '127.0.0.1', 1437660073, 1),
(236, 00000000042, '127.0.0.1', 1437661070, 1),
(237, 00000000042, '127.0.0.1', 1437667272, 1),
(238, 00000000042, '127.0.0.1', 1437668750, 1),
(239, 00000000042, '127.0.0.1', 1437722941, 1),
(240, 00000000042, '127.0.0.1', 1437727107, 1),
(241, 00000000042, '127.0.0.1', 1437811508, 1),
(242, 00000000042, '127.0.0.1', 1437811692, 1),
(243, 00000000042, '127.0.0.1', 1437959206, 1),
(244, 00000000042, '127.0.0.1', 1437959318, 1),
(245, 00000000042, '127.0.0.1', 1437965501, 1),
(246, 00000000042, '127.0.0.1', 1437968795, 1),
(247, 00000000042, '127.0.0.1', 1437969515, 1),
(248, 00000000042, '127.0.0.1', 1437976766, 1),
(249, 00000000042, '127.0.0.1', 1437981049, 1),
(250, 00000000042, '127.0.0.1', 1437981785, 1),
(251, 00000000042, '127.0.0.1', 1437981869, 1),
(252, 00000000042, '127.0.0.1', 1438005490, 1),
(253, 00000000042, '127.0.0.1', 1438044603, 1);

-- --------------------------------------------------------

--
-- 表的结构 `tm_logistics`
--

CREATE TABLE IF NOT EXISTS `tm_logistics` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT '物流ID',
  `orderid` int(11) NOT NULL COMMENT '订单ID',
  `logid` bigint(255) NOT NULL COMMENT '物流号',
  `logisticsname` char(20) NOT NULL COMMENT '快递公司名字',
  `logisticstime` int(50) NOT NULL COMMENT '发货时间',
  PRIMARY KEY (`id`)
) ENGINE=MyISAM  DEFAULT CHARSET=utf8 COMMENT='tm_logistics物流表' AUTO_INCREMENT=13 ;

--
-- 转存表中的数据 `tm_logistics`
--

INSERT INTO `tm_logistics` (`id`, `orderid`, `logid`, `logisticsname`, `logisticstime`) VALUES
(11, 6, 626341, 'quanfeng', 434343900),
(10, 5, 53535353, 'yunda', 56556900),
(9, 4, 40404040, 'shentong', 565670701),
(12, 7, 7373771, 'yuantong', 66645999);

-- --------------------------------------------------------

--
-- 表的结构 `tm_love`
--

CREATE TABLE IF NOT EXISTS `tm_love` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT '爱心活动ID',
  `uid` int(11) NOT NULL COMMENT '爱心用户ID',
  `lovemoney` decimal(10,2) NOT NULL COMMENT '爱心金额',
  `lovetime` int(50) NOT NULL COMMENT '爱心捐款时间',
  PRIMARY KEY (`id`)
) ENGINE=MyISAM  DEFAULT CHARSET=utf8 COMMENT='tm_love爱心活动表' AUTO_INCREMENT=13 ;

--
-- 转存表中的数据 `tm_love`
--

INSERT INTO `tm_love` (`id`, `uid`, `lovemoney`, `lovetime`) VALUES
(12, 2, '100.00', 1438045519);

-- --------------------------------------------------------

--
-- 表的结构 `tm_navigate`
--

CREATE TABLE IF NOT EXISTS `tm_navigate` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT '导航栏ID',
  `name` char(50) NOT NULL COMMENT '导航栏名字',
  `links` char(125) NOT NULL COMMENT '导航链接',
  PRIMARY KEY (`id`)
) ENGINE=MyISAM  DEFAULT CHARSET=utf8 COMMENT='tm_navigate导航栏表' AUTO_INCREMENT=14 ;

--
-- 转存表中的数据 `tm_navigate`
--

INSERT INTO `tm_navigate` (`id`, `name`, `links`) VALUES
(12, '诚聘英才', 'http://localhost/tongmeng/index.php/Job/job.html'),
(11, '奥迪玩具', 'http://localhost/tongmeng/index.php/Viewgoods/index/id/12.html'),
(13, '美泰玩具', 'http://localhost/tongmeng/index.php/Viewgoods/index/id/7.html');

-- --------------------------------------------------------

--
-- 表的结构 `tm_order`
--

CREATE TABLE IF NOT EXISTS `tm_order` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT '订单ID',
  `uid` int(11) NOT NULL COMMENT '用户ID',
  `ordernumber` bigint(50) NOT NULL COMMENT '订单号',
  `gid` int(11) NOT NULL COMMENT '商品ID',
  `good` varchar(255) NOT NULL COMMENT '商品名',
  `unitprice` decimal(10,2) NOT NULL COMMENT '商品单价',
  `num` int(10) NOT NULL DEFAULT '1' COMMENT '商品数量',
  `ispay` tinyint(1) NOT NULL DEFAULT '0' COMMENT '是否支付  1为支付 0为未支付',
  `totalprice` decimal(10,2) NOT NULL COMMENT '商品总价',
  `ordertime` int(32) NOT NULL COMMENT '订单时间',
  `addr` char(32) NOT NULL COMMENT '收货地址',
  PRIMARY KEY (`id`)
) ENGINE=MyISAM  DEFAULT CHARSET=utf8 AUTO_INCREMENT=48 ;

--
-- 转存表中的数据 `tm_order`
--

INSERT INTO `tm_order` (`id`, `uid`, `ordernumber`, `gid`, `good`, `unitprice`, `num`, `ispay`, `totalprice`, `ordertime`, `addr`) VALUES
(1, 1, 20150723200730, 2, '小熊钧泽C-02', '300.00', 3, 1, '900.00', 1437653250, '安徽省宿州市砀城镇d'),
(2, 1, 20150723200730, 11, '托马斯A-02', '34.00', 10, 1, '340.00', 1437653250, '安徽省宿州市砀城镇d'),
(4, 6, 20150727102921, 9, '酷跑飞机A-01', '677.00', 1, 1, '677.00', 1437964161, '请选择请选择请选择'),
(5, 6, 20150727102926, 9, '酷跑飞机A-01', '677.00', 1, 1, '677.00', 1437964166, '请选择请选择请选择'),
(6, 6, 20150727104122, 8, '酷跑A-03', '344.00', 1, 1, '344.00', 1437964882, '重庆市重庆市沙坪坝区asdsad'),
(7, 6, 20150727104219, 8, '酷跑A-03', '344.00', 1, 1, '344.00', 1437964939, '重庆市重庆市沙坪坝区asdsad'),
(8, 6, 20150727104232, 8, '酷跑A-03', '344.00', 1, 1, '344.00', 1437964952, '重庆市重庆市沙坪坝区asdsad'),
(9, 6, 20150727104236, 8, '酷跑A-03', '344.00', 1, 1, '344.00', 1437964956, '重庆市重庆市沙坪坝区asdsad'),
(10, 6, 20150727104337, 8, '酷跑A-03', '344.00', 1, 1, '344.00', 1437965017, '重庆市重庆市沙坪坝区asdsad'),
(11, 6, 20150727104341, 8, '酷跑A-03', '344.00', 1, 1, '344.00', 1437965021, '重庆市重庆市沙坪坝区asdsad'),
(12, 6, 20150727104504, 9, '酷跑飞机A-01', '677.00', 1, 1, '677.00', 1437965104, '重庆市重庆市沙坪坝区asdsad'),
(13, 6, 20150727104532, 9, '酷跑飞机A-01', '677.00', 1, 1, '677.00', 1437965132, '重庆市重庆市沙坪坝区asdsad'),
(14, 6, 20150727105743, 6, '酷跑A-01', '359.00', 1, 1, '359.00', 1437965863, '重庆市重庆市沙坪坝区asdsad'),
(15, 6, 20150727105756, 6, '酷跑A-01', '359.00', 1, 1, '359.00', 1437965876, '重庆市重庆市沙坪坝区asdsad'),
(16, 6, 20150727105824, 1, '小熊钧泽C-01', '399.00', 1, 1, '399.00', 1437965904, '重庆市重庆市沙坪坝区asdsad'),
(17, 6, 20150727105827, 1, '小熊钧泽C-01', '399.00', 1, 1, '399.00', 1437965907, '重庆市重庆市沙坪坝区asdsad'),
(18, 6, 20150727105928, 2, '小熊钧泽C-02', '300.00', 1, 1, '300.00', 1437965968, '重庆市重庆市沙坪坝区asdsad'),
(19, 6, 20150727110020, 2, '小熊钧泽C-02', '300.00', 1, 1, '300.00', 1437966020, '重庆市重庆市沙坪坝区asdsad'),
(20, 6, 20150727110117, 6, '酷跑A-01', '359.00', 1, 1, '359.00', 1437966077, '重庆市重庆市沙坪坝区asdsad'),
(21, 6, 20150727110317, 6, '酷跑A-01', '359.00', 1, 1, '359.00', 1437966197, '重庆市重庆市沙坪坝区asdsad'),
(22, 6, 20150727110438, 8, '酷跑A-03', '344.00', 1, 1, '344.00', 1437966278, '重庆市重庆市沙坪坝区asdsad'),
(23, 6, 20150727110549, 8, '酷跑A-03', '344.00', 1, 1, '344.00', 1437966349, '重庆市重庆市沙坪坝区asdsad'),
(24, 6, 20150727110623, 3, '小黄帽C-03', '298.00', 2, 1, '596.00', 1437966383, '重庆市重庆市沙坪坝区asdsad'),
(25, 6, 20150727110653, 3, '小黄帽C-03', '298.00', 2, 1, '596.00', 1437966413, '重庆市重庆市沙坪坝区asdsad'),
(26, 6, 20150727110926, 3, '小黄帽C-03', '298.00', 1, 1, '298.00', 1437966566, '重庆市重庆市沙坪坝区asdsad'),
(27, 6, 20150727110950, 1, '小熊钧泽C-01', '399.00', 1, 1, '399.00', 1437966590, '重庆市重庆市沙坪坝区asdsad'),
(28, 6, 20150727110954, 1, '小熊钧泽C-01', '399.00', 1, 1, '399.00', 1437966594, '重庆市重庆市沙坪坝区asdsad'),
(29, 6, 20150727110958, 1, '小熊钧泽C-01', '399.00', 1, 1, '399.00', 1437966598, '重庆市重庆市沙坪坝区asdsad'),
(30, 6, 20150727111002, 1, '小熊钧泽C-01', '399.00', 1, 1, '399.00', 1437966602, '重庆市重庆市沙坪坝区asdsad'),
(31, 6, 20150727111025, 1, '小熊钧泽C-01', '399.00', 1, 1, '399.00', 1437966625, '重庆市重庆市沙坪坝区asdsad'),
(32, 6, 20150727111035, 1, '小熊钧泽C-01', '399.00', 1, 1, '399.00', 1437966635, '重庆市重庆市沙坪坝区asdsad'),
(33, 6, 20150727111039, 1, '小熊钧泽C-01', '399.00', 1, 1, '399.00', 1437966639, '重庆市重庆市沙坪坝区asdsad'),
(34, 6, 20150727111215, 1, '小熊钧泽C-01', '399.00', 1, 1, '399.00', 1437966735, '重庆市重庆市沙坪坝区asdsad'),
(35, 6, 20150727111301, 1, '小熊钧泽C-01', '399.00', 1, 1, '399.00', 1437966781, '重庆市重庆市沙坪坝区asdsad'),
(36, 6, 20150727111333, 2, '小熊钧泽C-02', '300.00', 1, 1, '300.00', 1437966813, '重庆市重庆市沙坪坝区asdsad'),
(37, 6, 20150727111346, 2, '小熊钧泽C-02', '300.00', 1, 1, '300.00', 1437966826, '重庆市重庆市沙坪坝区asdsad'),
(38, 6, 20150727111350, 2, '小熊钧泽C-02', '300.00', 1, 1, '300.00', 1437966830, '重庆市重庆市沙坪坝区asdsad'),
(39, 6, 20150727111354, 2, '小熊钧泽C-02', '300.00', 1, 1, '300.00', 1437966834, '重庆市重庆市沙坪坝区asdsad'),
(40, 6, 20150727111451, 2, '小熊钧泽C-02', '300.00', 1, 1, '300.00', 1437966891, '重庆市重庆市沙坪坝区asdsad'),
(41, 6, 20150727111455, 2, '小熊钧泽C-02', '300.00', 1, 1, '300.00', 1437966895, '重庆市重庆市沙坪坝区asdsad'),
(42, 6, 20150727111527, 10, '托马斯A-01', '67.00', 1, 1, '67.00', 1437966927, '重庆市重庆市沙坪坝区asdsad'),
(43, 6, 20150727152218, 24, '遥控冠军E-07', '122.00', 1, 1, '122.00', 1437981738, '上海市上海市长宁区asdsad'),
(44, 6, 20150727152224, 24, '遥控冠军E-07', '122.00', 1, 1, '122.00', 1437981744, '上海市上海市长宁区asdsad'),
(45, 6, 20150727152228, 24, '遥控冠军E-07', '122.00', 1, 1, '122.00', 1437981748, '上海市上海市长宁区asdsad'),
(46, 4, 20150727164651, 8, '酷跑A-03', '344.00', 1, 1, '344.00', 1437986811, '内蒙古呼和浩特市回民区蒙牛'),
(47, 2, 20150728092353, 18, '聪明宝F-02', '190.00', 1, 1, '190.00', 1438046633, '山西省晋城市沁水县wwwwwww');

-- --------------------------------------------------------

--
-- 表的结构 `tm_recharge`
--

CREATE TABLE IF NOT EXISTS `tm_recharge` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT '充值历史ID',
  `uid` int(11) NOT NULL COMMENT '用户ID',
  `rechargemoney` decimal(10,2) NOT NULL COMMENT '充值金额',
  `rechargetime` int(50) NOT NULL COMMENT '充值时间',
  PRIMARY KEY (`id`)
) ENGINE=MyISAM  DEFAULT CHARSET=utf8 COMMENT='tm_recharge充值历史表' AUTO_INCREMENT=13 ;

--
-- 转存表中的数据 `tm_recharge`
--

INSERT INTO `tm_recharge` (`id`, `uid`, `rechargemoney`, `rechargetime`) VALUES
(2, 2, '123.57', 3477585),
(3, 1, '3456.98', 887477384),
(4, 2, '34.50', 222344444),
(10, 2, '33.00', 2131332342),
(11, 2, '32.00', 2147483647),
(12, 6, '3000.00', 0);

-- --------------------------------------------------------

--
-- 表的结构 `tm_reply`
--

CREATE TABLE IF NOT EXISTS `tm_reply` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT '回复ID',
  `fid` int(11) NOT NULL COMMENT '反馈ID',
  `replycontent` text NOT NULL COMMENT '回复内容',
  `replytime` int(50) NOT NULL COMMENT '回复时间',
  PRIMARY KEY (`id`)
) ENGINE=MyISAM  DEFAULT CHARSET=utf8 COMMENT='tm_reply反馈回复表' AUTO_INCREMENT=13 ;

--
-- 转存表中的数据 `tm_reply`
--

INSERT INTO `tm_reply` (`id`, `fid`, `replycontent`, `replytime`) VALUES
(3, 0, '', 0),
(1, 0, '', 0),
(4, 4, '', 0),
(5, 3, '如果大范甘迪', 0),
(6, 3, '阿的打算', 1436706049),
(7, 3, '俺师傅的十大', 1436706154),
(8, 3, 'yuyt ', 1436709521),
(9, 4, 'ertdrter', 1436788489),
(10, 4, '5y6r', 1436922939),
(11, 4, '1111', 1436958494),
(12, 13, '好的 老流氓', 1437661088);

-- --------------------------------------------------------

--
-- 表的结构 `tm_user`
--

CREATE TABLE IF NOT EXISTS `tm_user` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT '用户ID',
  `username` char(32) NOT NULL COMMENT '用户名',
  `password` char(33) NOT NULL COMMENT '用户密码',
  `auth` tinyint(3) NOT NULL DEFAULT '1' COMMENT '用户权限 0位关闭 1为开启',
  `status` int(3) NOT NULL DEFAULT '1' COMMENT '用户状态 0位关闭 1为开启',
  `regtime` int(32) NOT NULL COMMENT '用户注册时间',
  PRIMARY KEY (`id`),
  UNIQUE KEY `username` (`username`)
) ENGINE=MyISAM  DEFAULT CHARSET=utf8 COMMENT='tm_user 用户表' AUTO_INCREMENT=10 ;

--
-- 转存表中的数据 `tm_user`
--

INSERT INTO `tm_user` (`id`, `username`, `password`, `auth`, `status`, `regtime`) VALUES
(2, 'wang', 'e10adc3949ba59abbe56e057f20f883e', 0, 1, 1437655157),
(3, 'yong', '96e79218965eb72c92a549dd5a330112', 0, 1, 1437655227),
(4, 'japan', '96e79218965eb72c92a549dd5a330112', 0, 1, 1437655297),
(5, 'li', 'e10adc3949ba59abbe56e057f20f883e', 0, 1, 1437961084),
(6, 'hao', 'e10adc3949ba59abbe56e057f20f883e', 1, 1, 1437961802),
(7, '', 'd41d8cd98f00b204e9800998ecf8427e', 0, 1, 1437966994),
(8, '7', '8f14e45fceea167a5a36dedd4bea2543', 0, 1, 1437968583),
(9, '8', 'c9f0f895fb98ab9159f51fd0297e236d', 0, 1, 1437968702);

-- --------------------------------------------------------

--
-- 表的结构 `tm_userdetail`
--

CREATE TABLE IF NOT EXISTS `tm_userdetail` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT '用户详情ID',
  `uid` int(11) NOT NULL COMMENT '关联用户ID',
  `name` char(32) NOT NULL DEFAULT '童梦网' COMMENT '用户昵称',
  `sex` enum('0','1') NOT NULL DEFAULT '0' COMMENT '用户性别',
  `age` int(3) NOT NULL DEFAULT '0' COMMENT '用户年龄',
  `address` varchar(255) NOT NULL COMMENT '用户地址',
  `email` char(50) NOT NULL COMMENT '用户邮箱',
  `tel` bigint(15) NOT NULL COMMENT '用户电话',
  `credits` int(11) NOT NULL DEFAULT '0' COMMENT '用户积分',
  `money` decimal(10,2) NOT NULL COMMENT '用户余额',
  `pic` char(125) NOT NULL DEFAULT '/Uploads/default.png' COMMENT '用户头像',
  PRIMARY KEY (`id`)
) ENGINE=MyISAM  DEFAULT CHARSET=utf8 COMMENT='tm_userdetail 用户详情表' AUTO_INCREMENT=10 ;

--
-- 转存表中的数据 `tm_userdetail`
--

INSERT INTO `tm_userdetail` (`id`, `uid`, `name`, `sex`, `age`, `address`, `email`, `tel`, `credits`, `money`, `pic`) VALUES
(2, 2, 'wang', '0', 0, '', 'wangyong8506@163.com', 13220161612, 0, '710.00', '/Uploads/default.png'),
(3, 3, 'yong', '0', 0, '', 'yong8506@163.com', 13504920801, 0, '0.00', '/Uploads/default.png'),
(4, 4, 'japan', '1', 23, '日本东京都江户', 'japan123@163.com', 13664211970, 0, '0.00', 'Uploads/2015-07-24/55b2375c53679.jpg'),
(5, 5, 'li', '0', 30, 'hebei', 'li@qq.com', 13412345678, 200, '30000.00', 'Uploads/2015-07-27/55b58bbe2625a.jpg'),
(6, 6, '童梦网', '0', 30, 'hebei', 'hao@qq.com', 13412345678, 0, '32.00', 'Uploads/2015-07-27/55b5cc703567e.jpg'),
(7, 7, '', '0', 0, '', '', 0, 0, '0.00', '/Uploads/default.png'),
(8, 8, '7', '0', 0, '', '7', 7, 0, '0.00', '/Uploads/default.png'),
(9, 9, '8', '0', 0, '', '8', 8, 0, '0.00', '/Uploads/default.png');

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
